tap "argoproj/tap"
tap "getsentry/tools"
tap "hashicorp/tap"
tap "isen-ng/dotnet-sdk-versions"
tap "minamijoyo/tfmigrate"
tap "reviewdog/tap"
tap "ruffle-rs/ruffle"
tap "shivammathur/php"
tap "tomanthony/brews"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Text processing system for reStructuredText
brew "docutils"
# Asynchronous event library
brew "libevent"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Command-line tool to interact with exercism.io
brew "exercism"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# XSL-FO print formatter for making PDF or PS documents
brew "fop"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU awk utility
brew "gawk"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Conversion library
brew "libiconv"
# Postgres C API library
brew "libpq"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Open source relational database management system
brew "mysql"
# Libraries for security-enabled client and server applications
brew "nss"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Open source suite of directory software
brew "openldap"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# SOcket CAT: netcat on steroids
brew "socat"
# Editor of encrypted files
brew "sops"
# Secure Reliable Transport
brew "srt"
# Implementation of the Secure Real-time Transport Protocol
brew "srtp"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Terminal multiplexer
brew "tmux"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Kubectl Argo Rollouts Plugin.
brew "argoproj/tap/kubectl-argo-rollouts"
# Flash Player emulator written in Rust
brew "ruffle-rs/ruffle/ruffle", args: ["HEAD"]
# Allows you setup pre-configured layouts of panes in iTerm2
brew "tomanthony/brews/itermocil"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Redis desktop manager
cask "another-redis-desktop-manager"
# Cloud storage service
cask "baidunetdisk"
# E-books management software
cask "calibre"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# Matrix collaboration client
cask "element"
# Launcher for *Epic Games* games
cask "epic-games"
# Web browser
cask "firefox"
# PDF Editor
cask "foxit-pdf-editor"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Free and open-source media player
cask "iina"
# Tool for multi-language users
cask "input-source-pro"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# App to manage software development and track bugs
cask "linear"
# Discover, download, and run local LLMs
cask "lm-studio"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# App to write, plan, collaborate, and get organised
cask "notion"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Instant messaging tool
cask "qq"
# Archive manager for data compression and backups
cask "rar"
# Control your tools with a few keystrokes
cask "raycast"
# Tunneling proxy
cask "shadowsocksx-ng"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# VPN and WiFi proxy
cask "thunder"
# Web browser focusing on security
cask "tor-browser"
# Virtual machines UI using QEMU
cask "utm@beta"
# Open-source code editor
cask "visual-studio-code"
# Free messaging and calling application
cask "wechat"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "TradeFlex", id: 6751715293
vscode "anthropic.claude-code"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "lokalise.i18n-ally"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "redhat.vscode-yaml"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
npm "corepack"
